================================================================================
Simple displayed equation (dollar)
================================================================================

Foo $$ Bar Baz $$

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (displayed_equation
    (text
      (word)
      (word))))

================================================================================
Simple displayed equation (command)
================================================================================

Foo \[ Bar Baz \]

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (displayed_equation
    (command_name)
    (text
      (word)
      (word))
    (command_name)))

================================================================================
Displayed equation (mixed)
================================================================================

Foo \[ Bar Baz $$

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (displayed_equation
    (command_name)
    (text
      (word)
      (word))))

================================================================================
Displayed equation (nested)
================================================================================

Foo $$ Bar Baz \[ Qux \] $$

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (displayed_equation
    (text
      (word)
      (word))
    (displayed_equation
      (command_name)
      (text
        (word))
      (command_name))))

================================================================================
Displayed equation (flat)
================================================================================

Foo $$ Bar $$ Baz $$ Qux $$

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (displayed_equation
    (text
      (word)))
  (text
    (word))
  (displayed_equation
    (text
      (word))))

================================================================================
Simple inline formula (dollar)
================================================================================

Foo $ Bar Baz $

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (inline_formula
    (text
      (word)
      (word))))

================================================================================
Simple inline formula (command)
================================================================================

Foo \( Bar Baz \)

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (inline_formula
    (command_name)
    (text
      (word)
      (word))
    (command_name)))

================================================================================
Inline formula (mixed)
================================================================================

Foo \( Bar Baz $

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (inline_formula
    (command_name)
    (text
      (word)
      (word))))

================================================================================
Inline formula (nested)
================================================================================

Foo $ Bar Baz \( Qux \) $

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (inline_formula
    (text
      (word)
      (word))
    (inline_formula
      (command_name)
      (text
        (word))
      (command_name))))

================================================================================
Inline formula (flat)
================================================================================

Foo $ Bar $ Baz $ Qux $

--------------------------------------------------------------------------------

(source_file
  (text
    (word))
  (inline_formula
    (text
      (word)))
  (text
    (word))
  (inline_formula
    (text
      (word))))

================================================================================
Inline formula closed with double dollar
================================================================================

$ foo $$ bar

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (text
      (word))
    (word)))

================================================================================
Simple math set
================================================================================

\{ 1, 2, 3 \}

--------------------------------------------------------------------------------

(source_file
  (math_set
    (command_name)
    (text
      (word))
    (text
      (word))
    (text
      (word))
    (command_name)))
